kAMDSuccess = "Inget fel inträffade.";
kAMDUndefinedError = "Ett okänt fel inträffade.";
kAMDBadHeaderError = "Kunde inte överföra filen.";
kAMDNoResourcesError = "Kan inte tilldela en resurs.";
kAMDReadError = "Kunde inte läsa från enheten.";
kAMDWriteError = "Kunde inte skriva till enheten.";
kAMDUnknownPacketError = "Paketet är okänt.";
kAMDInvalidArgumentError = "Argumentet är ogiltigt.";
kAMDNotFoundError = "Filen kunde inte hittas.";
kAMDIsDirectoryError = "Sökvägen är en katalog.";
kAMDPermissionError = "Du har inte behörighet.";
kAMDNotConnectedError = "Inte ansluten till enheten.";
kAMDTimeOutError = "Åtgärden tog för lång tid.";
kAMDOverrunError = "Bufferten spillde över.";
kAMDEOFError = "Filslut.";
kAMDUnsupportedError = "Åtgärden stöds inte.";
kAMDFileExistsError = "Filen finns redan.";
kAMDBusyError = "Enheten är upptagen.";
kAMDCryptoError = "Kunde inte etablera en säker anslutning med enheten.";
kAMDTooBigError = "Meddelandet är för stort.";
kAMDInvalidResponseError = "Fick ett oväntat svar från enheten.";
kAMDMissingKeyError = "Nyckeln saknas.";
kAMDMissingValueError = "Värdet saknas.";
kAMDGetProhibitedError = "Kan inte hämta värdet från enheten låst med en lösenkod.";
kAMDSetProhibitedError = "Kan inte ställa in värde på enheten.";
kAMDRemoveProhibitedError = "Kan inte ta bort värde på enheten.";
kAMDImmutableValueError = "Värdet kan inte ändras.";
kAMDPasswordProtectedError = "Enheten är lösenordskyddad.";
kAMDMissingHostIDError = "Enheten känner inte till den här värden.";
kAMDInvalidHostIDError = "Enheten känner inte till den här värden.";
kAMDSessionActiveError = "Sessionen är aktiv.";
kAMDSessionInactiveError = "Sessionen är inte aktiv.";
kAMDMissingSessionIDError = "Session-ID saknas.";
kAMDInvalidSessionIDError = "Session-ID är ogiltigt.";
kAMDMissingServiceError = "Tjänsten saknas.";
kAMDInvalidServiceError = "Tjänsten är ogiltig.";
kAMDServiceLimitError = "Det körs redan för många instanser av den här tjänsten.";
kAMDCheckinSetupFailedError = "Kunde inte starta tjänsten på enheten";
kAMDInvalidCheckinError = "Kunde inte starta tjänsten på enheten";
kAMDCheckinTimeoutError = "Felaktig start av tjänsten på enheten.";
kAMDCheckinConnectionFailedError = "Felaktig start av tjänsten på enheten.";
kAMDCheckinReceiveFailedError = "Felaktig start av tjänsten på enheten.";
kAMDCheckinResponseFailedError = "Felaktig start av tjänsten på enheten.";
kAMDCheckinOutOfMemoryError = "Felaktig start av tjänsten på enheten.";
kAMDCheckinSendFailedError = "Felaktig start av tjänsten på enheten.";
kAMDMissingPairRecordError = "Värden är inte parkopplad med enheten.";
kAMDInvalidPairRecordError = "Värden är inte längre parkopplad med enheten.";
kAMDSavePairRecordFailedError = "Kunde inte spara parkopplingsposten.";
kAMDInvalidActivationRecordError = "Aktiveringsposten är ogiltig.";
kAMDMissingActivationRecordError = "Aktiveringsposten kunde inte hittas.";
kAMDServiceProhibitedError = "Tjänsten kunde inte startas på enheten.";
kAMDEscrowLockedError = "Enheten är inte tillgänglig innan den låsts upp för första gången efter den startats.";
kAMDProhibitedBySupervision = "Åtgärden tillåts inte på administrerade enheter.";
kAMDPairingProhibitedError = "Parkoppling endast tillåtet via USB.";
kAMDWrongDroidError = "Enheten är i återhämtningsläge.";
kAMDSUVerificationError = "Programuppdateringspaketet kunde inte kontrolleras.";
kAMDSUPatchError = "Kunde inte korrigera filen.";
kAMDSUFirmwareError = "Kunde inte skriva över den fasta programvaran.";
kAMDProvisioningProfileNotValid = "Tillhandahållandeprofilen är ogiltig.";
kAMDSendMessageError = "Kunde inte skicka ett meddelande till enheten.";
kAMDReceiveMessageError = "Kunde inte ta emot ett meddelande från enheten.";
kAMDMissingOptionsError = "Alternativen saknas.";
kAMDMissingImageTypeError = "Bilden saknas.";
kAMDDigestFailedError = "Kunde inte läsa skivavbild.";
kAMDStartServiceError = "Tjänsten kunde inte startas.";
kAMDInvalidDiskImageError = "Skivavbilden är ogiltig.";
kAMDMissingDigestError = "Hashkontrollen saknas.";
kAMDMuxError = "Ett fel inträffade med USB-enhetens multiplexor.";
kAMDApplicationAlreadyInstalledError = "Ett systemprogram med den angivna paketidentifieraren finns redan installerad på enheten och kan inte ersättas.";
kAMDApplicationMoveFailedError = "Programmet kunde inte flyttas till rätt plats på enheten.";
//kAMDApplicationSINFCaptureFailedError = "";
kAMDApplicationSandboxFailedError = "Programmet kunde inte isoleras.";
kAMDApplicationVerificationFailedError = "Programmet kunde inte verifieras.";
kAMDArchiveDestructionFailedError = "Kunde inte ta bort programarkivet.";
kAMDBundleVerificationFailedError = "Operatörspaketet kunde inte verifieras.";
kAMDCarrierBundleCopyFailedError = "Kunde inte installera operatörspaketet.";
kAMDCarrierBundleDirectoryCreationFailedError = "Kunde inte skapa katalogen för operatörspaket.";
kAMDCarrierBundleMissingSupportedSIMsError = "Det finns inga SIM-kort som stöds för det här operatörspaketet.";
kAMDCommCenterNotificationFailedError = "Kunde inte lyssna efter notis från basbandet.";
kAMDContainerCreationFailedError = "Kunde inte skapa programbehållare.";
kAMDContainerP0wnFailedError = "Kunde inte reparera programbehållarens behörigheter.";
kAMDContainerRemovalFailedError = "Kunde inte ta bort programbehållaren.";
kAMDEmbeddedProfileInstallFailedError = "Kunde inte installera den inbäddade tillhandahållandeprofilen.";
kAMDErrorError = "Ett fel inträffade.";
kAMDExecutableTwiddleFailedError = "Kunde inte ändra programmets körbara behörigheter.";
kAMDExistenceCheckFailedError = "Kunde inte kontrollera om programmet redan finns.";
kAMDInstallMapUpdateFailedError = "Kunde inte uppdatera listan med installerade program.";
kAMDManifestCaptureFailedError = "Kunde inte spara programmets manifest.";
kAMDMapGenerationFailedError = "Kunde inte generera kartan.";
kAMDMissingBundleExecutableError = "Programpaketet innehåller ingen körbar fil.";
kAMDMissingBundleIdentifierError = "Programpaketet har ingen giltig identifierare.";
kAMDMissingBundlePathError = "Kunde inte avgöra programpaketets sökväg.";
kAMDMissingContainerError = "Kunde inte hitta det installerade programmets behållare.";
kAMDNotificationFailedError = "Kunde inte posta en notis.";
kAMDPackageExtractionFailedError = "Kunde inte öppna programpaketet.";
kAMDPackageInspectionFailedError = "Kunde inte inspektera programpaketet.";
kAMDPackageMoveFailedError = "Kunde inte flytta programpaketet till iscensättningsplatsen.";
kAMDPathConversionFailedError = "Kunde inte konvertera sökvägen.";
kAMDRestoreContainerFailedError = "Kunde inte återställa programbehållaren.";
kAMDSeatbeltProfileRemovalFailedError = "Kunde inte ta bort programmets seatbelt-profil.";
kAMDStageCreationFailedError = "Kunde inte skapa katalogen för iscensättning.";
kAMDSymlinkFailedError = "Kunde inte skapa den symboliska länken.";
kAMDiTunesArtworkCaptureFailedError = "Kunde inte spara iTunes bildmaterial.";
kAMDiTunesMetadataCaptureFailedError = "Kunde inte spara iTunes metadata.";
kAMDAlreadyArchivedError = "Programmet har redan arkiverats.";
kAMDUnknownCommandError = "Enheten känner inte till kommandot.";
kAMDAPIInternalError = "Ett internt API-fel inträffade.";
kAMDMuxCreateListenerError = "Kunde inte lyssna efter USB-enheter.";
kAMDMuxGetListenerError = "Kunde inte kontakta USB-avlyssnaren.";
kAMDMuxConnectError = "Kunde inte ansluta till enheten.";
kAMDDeviceTooNewError = "Programmet måste uppdateras.";
kAMDDeviceRefNoGood = "Enheten är inte längre ansluten.";
kAMDDeviceDisconnectedError = "Enheten är inte längre ansluten.";
kAMDCannotTranslateError = "Kunde inte översätta meddelanden från enhet";
kAMDMobileImageMounterMissingImageSignature = "Kunde inte stöda utveckling.";
kAMDMobileImageMounterResponseCreationFailed = "Kunde inte stöda utveckling.";
kAMDMobileImageMounterMissingImageType = "Kunde inte stöda utveckling.";
kAMDMobileImageMounterMissingImagePath = "Kunde inte stöda utveckling.";
kAMDMobileImageMounterImageMapLoadFailed = "Kunde inte stöda utveckling.";
kAMDMobileImageMounterAlreadyMounted = "Kunde inte stöda utveckling.";
kAMDMobileImageMounterImageMoveFailed = "Kunde inte stöda utveckling.";
kAMDMobileImageMounterMountPathMissing = "Kunde inte stöda utveckling.";
kAMDMobileImageMounterMountPathNotEmpty = "Kunde inte stöda utveckling.";
kAMDMobileImageMounterImageMountFailed = "Kunde inte stöda utveckling.";
kAMDMobileImageMounterTrustCacheLoadFailed = "Kunde inte stöda utveckling.";
kAMDMobileImageMounterDigestFailed = "Kunde inte stöda utveckling.";
kAMDMobileImageMounterDigestCreationFailed = "Kunde inte stöda utveckling.";
kAMDMobileImageMounterImageVerificationFailed = "Kunde inte stöda utveckling.";
kAMDMobileImageMounterImageInfoCreationFailed = "Kunde inte stöda utveckling.";
kAMDMobileImageMounterImageMapStoreFailed = "Kunde inte stöda utveckling.";
kAMDDeviceOSVersionTooLow = "Enhetens OS-version är för låg.";
kAMDNoWifiSyncSupportError = "Enheten har inte stöd för trådlös synkronisering.";
kAMDDeviceFamilyNotSupported = "Programmet har inte stöd för den här typen av enhet.";
kAMDPackagePatchFailedError = "Kunde inte utföra uppdateringen av programmet.";
kAMDIncorrectArchitectureError = "Programmet har stöd för den här enhetens processortyp.";
kAMDPluginCopyFailedError = "Kunde inte kopiera VPN-insticksfilen till programbehållaren.";
kAMDBreadcrumbFailedError = "Kunde inte skriva installationsspår.";
kAMDBreadcrumbUnlockError = "Kunde inte uppdatera installationsspår.";
kAMDGeoJSONCaptureFailedError = "Kunde inte spara GeoJSON-data.";
kAMDNewsstandArtworkCaptureFailedError = "Kunde inte spara bildmaterial för Tidningskiosk.";
kAMDMissingCommandError = "Begäran innehöll inget kommando.";
kAMDNotEntitledError = "Programmet som gjorde begäran har inte tillåtelse att göra den här begäran.";
kAMDMissingPackagePathError = "Begäran saknade paketets sökväg.";
kAMDMissingContainerPathError = "Begäran saknade behållarens sökväg.";
kAMDMissingApplicationIdentifierError = "Begäran saknade programidentifieraren.";
kAMDMissingAttributeValueError = "Begäran saknade ett obligatoriskt värde.";
kAMDLookupFailedError = "Kunde inte lista installerade program.";
kAMDDictCreationFailedError = "Kunde inte extrahera möjligheter från begäran.";

/* kMISFileError */
"A file operation failed." = "En filåtgärd misslyckades.";

/* kMISModifiedResourcesError */
"A signed resource has been added, modified, or deleted." = "En signerad resurs har lagts till, ändrats eller raderats.";

/* kMISInvalidSignerError */
"A valid provisioning profile for this executable was not found." = "Hittade ingen giltig tillhandahållandeprofil för den här körbara filen.";

/* kMISUnknownError */
"An unknown error has occurred." = "Ett okänt fel har inträffat.";

/* kMISNotMutableError */
"Attempted to modify an immutable provisioning profile." = "Försökte modifiera en oföränderlig tillhandahållandeprofil.";

/* kMISApplicationSignatureNotValidError */
"The application does not have a valid signature." = "Programmet har ingen giltig signatur.";

/* kMISApplicationSignatureNotValidError */
"The application's signature is valid but it does not match the expected hash." = "Programmets signatur är giltig men matchar inte förväntad hash.";

/* kMISAdHocSignatureError */
"The executable contains an invalid signature." = "Den körbara filen innehåller en ogiltig signatur.";

/* kMISInvalidEntitlementError */
"The executable was signed with invalid entitlements." = "Den körbara filen signerades med ogiltiga behörigheter.";

/* kMISInvalidSignerCertError */
"The identity used to sign the executable is no longer valid." = "Identiteten som användes till att signera den körbara filen är inte längre giltig.";

/* kMISSignatureNotValidError */
"The signature was not valid." = "Signaturen var ogiltig.";

/* kMISConnectionClosedError */
"There was an error communicating with your device." = "Ett fel inträffade vid kommunikation med enheten.";

/* kMISUnsupportedDeviceError */
"This provisioning profile cannot be installed on this device." = "Tillhandahållandeprofilen kan inte installeras på den här enheten.";

/* kMISProfileSignatureNotValidError */
"This provisioning profile does not have a valid signature (or it has a valid, but untrusted signature)." = "Tillhandahållandeprofilen har ingen giltig signatur (eller den har en giltig signatur, men som inte är betrodd).";

/* kMISExpiredError */
"This provisioning profile has expired." = "Tillhandahållandeprofilen har gått ut.";

/* kMISMalformedProfileError */
"This provisioning profile is malformed." = "Tillhandahållandeprofilen har fel format.";

/* kMISUnsupportedVersionError */
"This provisioning profile is unsupported." = "Tillhandahållandeprofilen stöds inte.";

/* kMISAllocationError */
"Unable to allocate memory." = "Kan inte tilldela minne.";

